app/views/todo_lists/index.html.erb

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ?  [["todo_list_id", 324]]
SELECT "todo_lists".* FROM "todo_lists"
---
        <td><%= link_to todo_list.list_name, todo_list %></td>
        <td class="<%= todo_list.todoItems.all? { |item| item.done? } ? 'done' : 'not_done' %>"><%= todo_list.list_due_date %></td>