app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ?  [["user_id", 102]]
---
  def index
    @accounts = Account.where(user_id: current_user.id)

INSERT INTO "accounts" ("gender", "age", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["gender", "Male"], ["age", 25], ["first_name", "Ross"], ["last_name", "Mills"], ["created_at", "2017-11-06 23:07:55.030740"], ["updated_at", "2017-11-06 23:07:55.030740"]]
---
  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save

UPDATE "accounts" SET "age" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["age", 26], ["updated_at", "2017-11-12 22:13:17.820662"], ["id", 22]]
---
  def update
    respond_to do |format|
      if @account.update(account_params)

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."id" = ? LIMIT ?  [["user_id", 102], ["id", 22], ["LIMIT", 1]]
---
    def set_account
      @account = Account.where(user_id: current_user.id).find(params[:id])