app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."login" = ? LIMIT ?  [["login", "ross"], ["LIMIT", 1]]
---
  def create
  	login = params[:user][:login]
  	password = params[:user][:password]

  	user = User.find_by login: login