app/controllers/todo_items_controller.rb

SELECT "todo_lists"."id" FROM "todo_lists" WHERE "todo_lists"."user_id" = ?  [["user_id", 157]]
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" IN (332, 333) LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 5]]
SELECT COUNT(*) FROM "todo_items" WHERE "todo_items"."todo_list_id" IN (332, 333)
---
  def index
    @todo_lists = TodoList.where(user_id: current_user.id)
    @todo_items = TodoItem.where(todo_list_id: @todo_lists.ids)
    @todo_items = @todo_items.paginate(page: params[:page], per_page: 5)

UPDATE "todo_items" SET "done" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["done", "t"], ["updated_at", "2017-11-12 23:52:43.887849"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @todo_item.update(todo_item_params)

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT 1  [["id", 411]]
UPDATE "todo_items" SET "done" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["done", "t"], ["updated_at", "2017-12-05 00:26:27.253907"], ["id", 411]]
SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", nil]]
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ?  [["todo_list_id", 350]]
---
  def mark_complete
    ti = TodoItem.find(params[:todo_item_id])
    ti.update_attribute(:done, true)
    @todo_list = TodoList.find(ti.todo_list_id)

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_todo_item
      @todo_item = TodoItem.find(params[:id])