app/controllers/todo_lists_controller.rb

  def index
    @todo_lists = TodoList.where(user_id: current_user.id)
    @todo_lists = @todo_lists.paginate(page: params[:page], per_page: 5)
    @todo_items = TodoItem.where(todo_list_id: @todo_lists.ids)
---
SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."user_id" = ? AND "todo_lists"."id" = ? LIMIT ?  [["user_id", 157], ["id", 333], ["LIMIT", 1]]
SELECT  "todo_lists"."id" FROM "todo_lists" WHERE "todo_lists"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 157], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "todo_lists" WHERE "todo_lists"."user_id" = ?  [["user_id", 157]]
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? LIMIT ? OFFSET ?  [["todo_list_id", 333], ["LIMIT", 5], ["OFFSET", 0]]

  def show
    puts "PAGE: "
    puts params[:page]
    puts @todo_list.id
    @todo_items = TodoItem.where(todo_list_id: @todo_list.id).paginate(page: params[:page], per_page: 5)
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? LIMIT ? OFFSET ?  [["todo_list_id", 332], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "todo_items" WHERE "todo_items"."todo_list_id" = ?  [["todo_list_id", 332]]

  def create
    @todo_list = TodoList.where(user_id: current_user.id).new(todo_list_params)

    respond_to do |format|
      if @todo_list.save
---
INSERT INTO "todo_lists" ("list_name", "list_due_date", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["list_name", "My new List!"], ["list_due_date", "05/27/2018"], ["created_at", "2017-11-12 22:14:40.238228"], ["updated_at", "2017-11-12 22:14:40.238228"], ["user_id", 101]]

  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)
---
UPDATE "todo_lists" SET "list_due_date" = ?, "updated_at" = ? WHERE "todo_lists"."id" = ?  [["list_due_date", "12/21/2017"], ["updated_at", "2017-11-12 22:09:20.155347"], ["id", 117]]

  def destroy
    @todo_list.destroy
---
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 119]]

    def set_todo_list
      @todo_list = TodoList.where(user_id: current_user.id).find(params[:id])
---
SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."user_id" = ? AND "todo_lists"."id" = ? LIMIT ?  [["user_id", 102], ["id", 117], ["LIMIT", 1]]